import re
pattern = re.compile(
    r'http[s]?://(?:[a-zA-Z]|[0-9]|[$-_@.&+]|[!*\(\),]|(?:%[0-9a-fA-F][0-9a-fA-F]))+')    # 匹配模式

# string = '{"url": "https://sports.163.com/20/1127/07/FSE2D7IF00058781.html?clickfrom=w_lb_1_big", "depth": 1, "title": "太过分!葬礼工作人员合影马拉多纳遗体 立刻遭解雇", "section": "sports", "time": "2020-11-27 07:25:39", "source": "网易体育", "content": ["网易体育11月27日报道：", "在阿根廷总统府，马拉多纳的灵柩被阿根廷国旗、阿根廷球衣和博卡球衣覆盖着。但在社交网络上，却传出了一张老马去世后的", "照。拍摄这张照片的，是", "工作人员", "。", "此时此刻，我比以往任何时刻都确信，这首1986年世界杯主题曲，正是一代球王迭戈-马拉多纳之于我们所有人的意义。", "在这张照片中，老马仰面朝天躺在棺材中。迭戈-莫利纳右手放在老马额头上，左手对着镜头做了个竖大拇指的动作。迭戈-莫利纳将这张照片传到了社交网络上，这张合影很快引发了爆炸级别的效果。", "无论迭戈-莫利纳出于何种目的，他的这一做法显然都对老马缺乏应有的尊重。老马的律师好友莫拉已经怒了：“为了我的朋友，在迭戈-莫利纳付出代价之前，我永远不会停手！”", "在此事发酵之后，工作方立刻解雇了迭戈-莫利纳，迭戈-莫利纳也向马拉多纳家人进行了私人道歉。工作方还在对此事进行调查，还有三名工作人员很可能会因此丢饭碗。", "殡葬工与马拉多纳遗体合影被解雇"]}{"url": "https://ent.163.com/20/1127/07/FSE1LCVV00038FO9.html?clickfrom=w_ent", "depth": 1, "title": "张纪中评《花木兰》：问题不在刘亦菲而在编剧", "section": "ent", "time": "2020-11-27 07:12:38", "source": "网易娱乐", "content": ["11月26日，在金鸡奖活动中，知名导演", "评价电影《", "》：“", "我很熟悉，但电影不是她的问题，是编剧的问题，编剧对中国的文化不是那么懂，他对于‘气’的理解也不是那么清楚，很多东西都误解了。他所设计的情节和我们传统意义上所讲的花木兰的精神离得比较远，戏剧结构冲突没起来，节奏非常缓慢。”", "", "", "", "", "", "据悉，曾被看好的《花木兰》在上映之后反响很差，内地票房仅有2.78亿，评分也只有5分。此前，除了剧情上遭到吐槽，主演刘亦菲的演技也备受质疑。", ""]}'
with open("./Netease_news/news.json") as f:
    string = f.read()
url = re.findall(pattern, string)
# print('\n'.join(list(url)))
print(len(url))
print(type(url))
